<?php
return [
    #可在业务中自定义 message
    #系统类
    "-1"=> "系统繁忙",
    "0"=> "请求成功",
    #Token 类
    "40001"=> "不合法的Token",
    "40002"=> "Token 已失效",
    "40003"=> "缺少Token参数",
    "40004"=> "Token超时",
    "40005"=> "配置数据已过期",
    "40006"=> "账户在其他地方登录，您已被强制下线",

    #附件类
    "41001"=> "不合法的媒体文件类型",
    "41002"=> "不合法的附件类型",
    "41003"=> "不合法的附件大小",
    "41004"=> "不合法的视频文件大小",

    #请求类
    "42001"=> "不合法的请求字符，不能包含\uxxxx格式的字符",
    "42002"=> "不合法的参数",
    "42003"=> "不合法的请求格式",
    "42004"=> "不合法的URL长度",
    "42005"=> "需要GET请求",
    "42006"=> "需要POST请求",
    "42007"=> "需要HTTPS请求",
    "42008"=> "POST的数据包为空",
    "42009"=> "请求次数太频繁",
    "42010"=> "没有访问权限",
    "42011"=> "缺少参数",

    #登录/注册类
    "43001"=> "不合法的登录类型",
    "43002"=> "不存在的用户",
    "43003"=> "不合法的OpenID",
    "43004"=> "不合法的账号",
    "43005"=> "图形验证码错误",
    "43006"=> "手机验证码错误",
    "43007"=> "账号不能为空",
    "43008"=> "密码不能为空",
    "43009"=> "图形验证码不能为空",
    "43010"=> "账号错误",//离职了的数据也是用它
    "43011"=> "密码错误",
    "43012"=> "账号或密码错误",
    "43013"=> "账号已被禁用",
    "43014"=> "账号已锁，请联系相关管理员",
    "43015"=> "指纹无法识别",
    "43016"=> "指纹不匹配",
    "43017"=> "手机号码不匹配",
    "43018"=> "未绑定手机号",
    "43019"=> "未绑定微信",
    "43020"=> "密码不一致",
    "43021"=> "账号或手机号已存在",
    "43022"=> "原始密码输入错误",
    "43023"=> "手机号不能为空",
    "43024"=> "不存在的手机号",
    "43025"=> "登录失败，用户名或密码错误！该账号已被锁定，请联系管理员解锁",
    "43026"=> "登录失败，用户名或密码错误！",
    "43027"=> "登录失败，用户名或密码错误！您还有{var1}次机会，系统将会锁定账号！",
    "43028"=> "验证码发送失败",
    "43029"=> "超级管理员不能删除",
    "43030"=> "已存在绑定关系，建议停用账户",


    #手机类
    "44001"=> "不合法的手机号",
    "44002"=> "手机号不能为空",
    "44003"=> "手机验证码不能为空",
    "44004"=> "手机验证码发送频繁",

    #操作类
    "45001"=> "删除成功",
    "45003"=> "操作成功",
    "45005"=> "绑定成功",
    "45007"=> "重置成功",
    "45009"=> "采集成功",
    "45010"=> "登录成功",
    "45011"=> "上传成功",

    "46001"=> "删除失败",
    "46002"=> "操作失败",
    "46003"=> "绑定失败",
    "46004"=> "重置失败",
    "46005"=> "采集失败",
    "46006"=> "上传失败",

    "47001"=> "一级机构已存在",
    "47002"=> "同一机构中，名称不能重复",
    "47003"=> "类型错误，类型不能与父级一致并且不能大于父级类型",
    "47004"=> "删除失败，没有操作权限",
    "47005"=> "删除失败，机构或子机构绑定了人员",
    "47006"=> "该机构不允许添加人员",
    "47007"=> "重复的机构名称",
    "47008"=> "编辑失败，角色绑定了人员不允许更换到其它区域",

    #档案模块
    "48001"=> "缺少来源模块参数",
    "48002"=> "缺少文件夹ID参数",
    "48003"=> "缺少数据ID参数",
    "48004"=> "缺少项目ID参数",
    "48005"=> "缺少文件关联ID参数",
    "48006"=> "缺少文件名称参数",
    "48007"=> "共享文件不能删除",
    "48008"=> "文件夹已存在",
    "48009"=> "文件夹删除失败,已绑定其它模块",
    "48010"=> "重复绑定文件夹",
    "48011"=> "文件夹存在子级，请先删除子级",
    "48012"=> "文件夹存在文件，请先删除文件",

];
